from services.Chinese_Financial_Statements.base_financial_detail_service import BaseFinancialDetailService


class TianMao_FinancialDetailService(BaseFinancialDetailService):
    remark_col = "备注"

    KEYWORD_MAP = {
        "代扣返点积分": ["代扣返点积分"],
        "代扣交易退回积分": ["代扣交易退回积分"],
        "天猫保证金-延迟发货": ["天猫保证金-充值（代扣）-延迟发货"],
        "天猫保证金-虚假发货": ["天猫保证金-充值（代扣）-虚假发货"],
        "淘宝天猫跨境服务增值费": ["淘宝天猫跨境服务增值费"],
        "天猫保证金-缺货": ["天猫保证金-充值（代扣）-缺货"],
        "天猫保证金-物流轨迹超时": ["天猫保证金-充值（代扣）-物流轨迹超时"],
        "天猫佣金": ["代扣款（扣款用途：天猫佣金（类目系统）"],
        "品牌新享-首单拉新计划": ["品牌新享-首单拉新计划"],
        "天猫保证金-退货邮费": ["天猫保证金-充值（代扣）-退货邮费"],
        "基础软件服务费": ["基础软件服务费"],
        "商家集运物流服务费": ["代扣款（扣款用途：商家集运物流服务费"],
        "商家集运中转操作费": ["代扣款（扣款用途：商家集运中转操作费"],
    }