from services.Chinese_Financial_Statements.base_financial_detail_service import BaseFinancialDetailService


class FinancialDetailService(BaseFinancialDetailService):
    remark_col = "备注"

    KEYWORD_MAP = {
        "跨境佣金服务费": ["代扣款（扣款用途：跨境佣金服务费"],
        "1688增值买家保障服务费": ["1688增值买家保障服务费"],
        "1688增值服务-先采后付服务费": ["1688增值服务-先采后付服务费"],
        "1688增值服务-先采后付提前回款费用": ["1688增值服务-先采后付提前回款费用"],
        "AI帮卖软件服务费": ["多渠道 AI 帮卖软件服务费"],
        "1688分销客佣金代扣款": ["1688分销客佣金代扣款"],
        "严选软件服务费及代运营服务费": ["代扣款（扣款用途：严选软件服务费及代运营服务费"],
        "1688保证金交易理赔": ["1688保证金-支付-产生交易理赔"],
        "1688大分销业务平台抽佣": ["代扣款（扣款用途：1688大分销业务平台抽佣"],
        "1688-极速周转-服务费": ["1688增值服务-1688-极速周转-服务费"],
        "1688供应链服务-跨境渠道": ["代扣款（扣款用途：1688供应链服务-跨境渠道"],
        "PLUS会员店软件服务费及代运营服务费": ["代扣款（扣款用途：PLUS会员店软件服务费及代运营服务费"],
        "PLUS严选店软件服务费及代运营服务费": ["代扣款（扣款用途：PLUS严选店软件服务费及代运营服务费"],
        "1688保证金-违规罚金": ["1688保证金-支付-违规罚金", "保险承保-违规罚金", "违规罚金"],
        "1688买家体验赔付": ["1688买家体验赔付_仅退款体验赔付"],
        "1688保证金-1688服务赔付": ["1688保证金-支付-1688保证金-1688服务赔付"],
        "托管新品打爆套餐扣费": ["代扣款（扣款用途：托管新品打爆套餐扣费"],
    }

    SPECIAL_KEYS = ["1688保证金交易理赔", "1688保证金-违规罚金"]