from services.Chinese_Financial_Statements.base_financial_detail_service import BaseFinancialDetailService


class TaoBao_FinancialDetailService(BaseFinancialDetailService):
    remark_col = "备注"

    KEYWORD_MAP = {
        "卖家版运费险保费": ["保险承保-卖家版运费险保费收取"],
        "卖家延迟发货赔付红包-赔付红包": ["商家权益红包-预算追加-卖家延迟发货赔付红包-赔付红包"],
        "淘宝虚假发货赔付红包-赔付红包": ["商家权益红包-预算追加-淘宝虚假发货赔付红包-赔付红包"],
        "淘宝缺货赔付红包-赔付红包": ["商家权益红包-预算追加-淘宝缺货赔付红包-赔付红包"],
        "淘宝天猫跨境服务增值费": ["淘宝天猫跨境服务增值费"],
        "淘宝天猫跨境服务基础费": ["淘宝天猫跨境服务基础费"],
        "淘宝物流轨迹异常红包-赔付红包": ["商家权益红包-预算追加-淘宝物流轨迹异常红包-赔付红包"],
        "淘宝物流轨迹超时红包-赔付红包": ["商家权益红包-预算追加-淘宝物流轨迹超时红包-赔付红包"],
        "基础软件服务费": ["基础软件服务费"],
        "本地退赔款": ["太保产险苏州本地退赔款"],
        "实收金额差价": ["订单金额与实际金额不一致，订单金额比实际金额高为正数，少为负数"],
        "商家权益红包-预算追加-客户体验保障红包-赔付红包": ["客户体验保障红包-赔付红包"],
        "基础软件服务费（返还）": ["代扣款（扣款用途：基础软件服务费（返还）"],
    }