from services.Chinese_Financial_Statements.base_financial_detail_service import BaseFinancialDetailService


class Pxx_FinancialDetailService(BaseFinancialDetailService):
    remark_col = "业务描述"

    KEYWORD_MAP = {
        "技术服务费": ["0030002|技术服务费-基础技术服务费", "0030001|技术服务费-技术服务费"],
        "基础技术服务费": ["0030002|技术服务费-基础技术服务费"],
        "基础技术服务费返还": ["0030002|技术服务费-基础技术服务费"],
        "多多进宝": ["0060001|营销费用-多多进宝"],
        "售后费用-缺货": ["0040006|售后费用-缺货"],
        "售后费用-售后补偿消费者": ["0040002|售后费用-售后补偿消费者"],
        "售后费用-虚假发货": ["0040005|售后费用-虚假发货"],
        "售后费用-延迟发货": ["0040004|售后费用-延迟发货"],
        "售后费用-运费补偿": ["0040003|售后费用-运费补偿"],
        "偏远和境外地区物流费用扣除": ["0140002|其他支出-分账支出"],
        "商家申诉成功": ["0130005|其他收入-申诉补回"],
    }