from dotenv import load_dotenv
import os

# 店铺分组（后面自动分配用）
SHOP_GROUPS = [
    ["8249645", "8246209", "6665344"],
    ["4720369", "6666485"],
    ["8368031", "8246006", "8625842"],
    ["8248727", "8369148", "7790171"],
    ["8371473", "9262177", "6726588"],
    ["8248902", "8248902", "8248832"],
]

# 店铺之间的映射
shop_id = {
    "101": "8249645", "2101": "8246209", "1101": "6665344",
    "102": "4720369", "1103": "6666485",
    "103": "8368031", "110": "8246006", "1107": "8625842",
    "104": "8248727", "105": "8369148", "1105": "7790171",
    "106": "8371473", "2106": "9262177", "1104": "6726588",
    "108": "8248902", "1108": "8248902", "109": "8248832",
}


category_list = [
    '磁力玩具', '弹跳玩具',  '存钱罐', '办公桌面磁力球拼图', '办公桌面运动玩具',
    'Fidget 指环', 'Fidget 游戏垫',
    'Pop Fidget 玩具', 'Simple Dimple Fidget 玩具', '多物品 Fidget 玩具包', '堆叠积木玩具', '齿轮联锁拼插玩具套装',
    '堆积和组装玩具公仔',
    '磁性积木玩具套装', '电子宠物', '掌上游戏机', '多面骰子', '单打卡牌游戏系列',  '多米诺及骨牌游戏',
    '地板游戏', '叠叠塔游戏',
    '电子学习系统软件套装', '弹珠轨道玩具', '磁性和毛毡游戏板',  '儿童服装珠宝套装', '儿童服装魔杖', '弹珠',
    '豆袋游戏板', '豆袋游戏套装',
       '拨浪鼓、摇铃和毛绒抓握玩具', '电子早教玩具', '插槽车轨道',
    '感官运动辅助用品', '玩具模型摩托车',
     '其他（新奇玩具）', '飞机模型组装套装', '降落伞人偶玩具', '算命玩具', '搞笑整蛊玩具', '杂耍组合',
    '微型创意玩具', '套娃娃', '万花筒',
    '史莱姆玩具', '发条、弹簧类玩具', '魔术玩具', '水气球', '新奇陀螺', '挤压玩具', '新奇硬币', '指尖陀螺', '无限立方体',
    '解压骰子、解压魔方', '木艺',
    '数字涂色', '拼插玩具套装', '拼插玩具收纳和配件',  '游戏棋子及组件', '陀螺', '棋盘游戏',
    '旅行游戏、口袋游戏', '游戏集合',
    '家庭保龄球道', '组合游戏桌', '微型弹珠机', '街机电子游戏', '喝酒游戏', '桌上乒乓球游戏', '桌上台球和游泳池游戏',
    '骰子游戏', '生词卡片', '学习和教育书写辅具',
    '科学类玩具', '生态环境类学习玩具', '排序、堆砌、拼插玩具', '玩具梳妆台', '玩具角色扮演套装', '过家家工具',
    '儿童烹饪套件', '过家家厨房组合', '仿真食物',
    '过家家烹饪用具', '玩具餐具', '玩具茶具套装', '玩具购物车', '玩具购物篮', '玩具收银机', '玩具钱与收银机',
    '医生游戏', '儿童珠宝盒', '模拟手机和智能手机',
    '戒指', '化妆品', '美发与头发装扮', '儿童游戏化妆和珠宝套装', '过家家钱包、提包', '玩具园艺工具', '儿童海洋球',
     '玩具豆袋', '儿童健身器材',
    '玩具风车、风铃', '玩具弹跳棒', '跳跳球', '浮力棒', '潜水环、潜水棒', '沙滩玩具', '游泳池篮球玩具', '游泳池排球玩具',
    '水枪', '洒水玩具', '沙滩球',
    '其他（体育玩具）', '玩具棒球', '玩具篮球', '玩具橄榄球', '玩具高尔夫球', '玩具曲棍球', '玩具足球', '皮球',
    '玩具平衡板',
    '玩具泡沫弹药', '玩具泡沫炮套装', '探险玩具', '泡泡机', '陀螺玩具', '牙胶', '婴幼儿车挂、床挂玩具', '婴幼儿镜子',
    '婴幼儿音乐玩具', '婴儿手抓球',
    '推拉玩具、学步车', '敲击玩具', '其他（婴幼儿早教和活动玩具）', '排序、堆砌、拼插玩具', '活动木立方', '珠算架',
    '活动中心', '儿童派对礼品包', '玩具手指车',
    '玩具火车铁轨套装', '机动车玩具组合', '轨道车赛车套装', '玩具卡车', '玩具巴士', '玩具摩托车', '玩具救护车',
    '玩具汽车和赛车', '玩具越野车', '玩具多功能工程车',
    '玩具挖掘机', '玩具起重机', '玩具火车套装', '其他（玩具车）', '游戏垫和棋盘',
    '儿童派对礼品包', '跳舞毯', '会讲故事的玩具',
    '儿童平板电脑', '骰子', '角色扮演骰子'
]

# 每店每次采集数量
SHOP_DAILY_LIMIT = 50

# 并发配置
MAX_WORKERS = 3

# 类目列表
# 用于品类选择页面（对应 get_today_categories）
CATEGORIES_FOR_CATEGORY_INPUT = [
    "新奇玩具",
    "艺术与工艺品",
    "拼插类玩具",
    "娃娃及配件",
    "遥控和应用程序控制的玩具汽车"
]

# 用于子类目选择页面（对应 get_today_sub_categories）
CATEGORIES_FOR_SUB_CATEGORY_INPUT = [
    "电子类玩具",
    "游戏及配件",
    "游戏配件",
    "卡牌游戏",
    "益智、科教玩具",
    "过家家",
    "拼图",
    "婴幼玩具",
    "运动户外用品",
    "玩具车",
    "收藏玩具",
    "节日聚会用品",
]

load_dotenv()

DB_CONFIG = {
    'host': os.getenv('DB_HOST', 'rm-bp186omby3lautfn0no.mysql.rds.aliyuncs.com'),
    'port': int(os.getenv('DB_PORT', 3306)),
    'user': os.getenv('DB_USER', 'root_lxz'),
    'password': os.getenv('DB_PASSWORD', 'Lxz123456'),
    'database': os.getenv('DB_NAME', 'py_spider'),
    'charset': 'utf8mb4'
}
